Core/src/Catalogs/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалогов</name>
  <predefined>
    <items>
      <name>АвансовыйПлатежПриУСН</name>
      <description>Авансовый платеж (УСН)</description>
    </items>
    <items>
      <name>ПФРСвыше300тр</name>
      <description>Взносы в ПФР при доходах свыше 300 тысяч руб.(ИП)</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Единый налог(ЕНВД)</description>
    </items>
    <items>
      <name>ЕдиныйНалогПриУСН</name>
      <description>Единый налог(УСН)</description>
    </items>
    <items>
      <name>Патент</name>
      <description>Налог с патента</description>
    </items>
    <items>
      <name>НДФЛКВыплате</name>
      <description>НДФЛ к выплати</description>
    </items>
    <items>
      <name>НДФЛНачисленный</name>
      <description>НДФЛ Начисленный</description>
    </items>
    <items>
      <name>НДФЛСотрудники</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>ПФРСтраховаяСотрудники</name>
      <description>Страховые взносы в ПФР по сотрудникам</description>
    </items>
    <items>
      <name>ПФРНакопительнаяСотрудники</name>
      <description>Страховые взносы в ПФР, накопительная часть по сотрудникам (до 2014 г)</description>
    </items>
    <items>
      <name>ФСССотрудники</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССТравматизмСотрудники</name>
      <description>Страховые взносы в ФСС от несчастных случаев</description>
    </items>
    <items>
      <name>ФОМССотрудники</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Фиксированные взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Фиксированные взносы в ПФР, накопительная часть (до 2014 г)</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>Фиксированные взносы в ТФОМС</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Фиксированные взносы в ФФОМС</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещению</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <comment>Заполняется для поставляемых данных</comment>
    <type>
      <types>EnumRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ВидыНалогов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
	
		Если Не ПустаяСтрока(КорреспондирующийСчет) Тогда
			Если ПустаяСтрока(СтрЗаменить(КорреспондирующийСчет, ".", "")) Тогда
				КорреспондирующийСчет = "";
			ИначеЕсли Прав(СокрЛП(КорреспондирующийСчет), 1) = "." Тогда
				КорреспондирующийСчет = Лев(СокрЛП(КорреспондирующийСчет), СтрДлина(СокрЛП(КорреспондирующийСчет)) - 1);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//+++ Дмгг
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКВозмещению");
	КонецЕсли;
		
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#КонецЕсли
